open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_vision_service.c
/****************************************************************************
 * app/bk7258/bk7258_vision_service.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * AP-owned V4L2 snapshot and bounded local MJPEG recording service.
 * Only command results cross RPMsg; pixels remain on AP-owned storage.
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_BK7258_VISION_SERVICE

#include "bk7258_vision_core.h"
#include "bk7258_vision_protocol.h"
#include "bk7258_vision_service.h"
#include "bk7258_vision_record.h"
#include "bk7258_media_volume.h"

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
#include "bk7258_display_service.h"
#include "bk7258_vision_feedback.h"
#endif

#include <errno.h>
#include <fcntl.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <sys/mount.h>
#include <sys/stat.h>
#include <string.h>
#include <sys/ioctl.h>
#include <sys/mman.h>
#include <sys/videoio.h>
#include <unistd.h>

#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/mutex.h>
#include <nuttx/rpmsg/rpmsg.h>
#include <nuttx/semaphore.h>
#include <nuttx/signal.h>
#include <nuttx/spinlock.h>


#define BKVISION_MOUNTPOINT "/mnt/sdnand"
#define BKVISION_RECORD_ROOT BKVISION_MOUNTPOINT "/recordings"
#define BKVISION_RECORD_BUFFERS CONFIG_BK7258_VISION_RECORD_BUFFERS
#define BKVISION_RECORD_WRITE_BUFFER_SIZE (16u * 1024u)

/* Retain ownership across a failed unmount; retry before the next record. */
static bool g_record_mounted;
static bool g_record_leased;

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
static int bkvision_feedback_set_expression(void *arg,
                                            const char *expression)
{
  (void)arg;
  return bk7258_display_set_expression(expression);
}

static int bkvision_feedback_replace_expression(void *arg,
                                                const char *expected,
                                                const char *replacement)
{
  (void)arg;
  return bk7258_display_replace_expression(expected, replacement);
}

static void bkvision_feedback_wait(void *arg, unsigned int milliseconds)
{
  (void)arg;
  nxsig_usleep(milliseconds * 1000u);
}

static const struct bkvision_feedback_ops_s g_bkvision_feedback_ops =
{
  .set_expression = bkvision_feedback_set_expression,
  .replace_expression = bkvision_feedback_replace_expression,
  .wait_ms = bkvision_feedback_wait,
};
#endif

struct bkvision_server_s
{
  struct rpmsg_endpoint endpoint;
  mutex_t init_lock;
  mutex_t endpoint_lock;
  spinlock_t request_lock;
  sem_t request_sem;
  volatile bool initialized;
  volatile bool endpoint_created;
  bool active;
  bool replay_valid;
  struct bkvision_rpc_request_s active_request;
  struct bkvision_rpc_request_s last_request;
  struct bkvision_rpc_response_s last_response;
};

static struct bkvision_server_s g_bkvision_server =
{
  .init_lock = NXMUTEX_INITIALIZER,
  .endpoint_lock = NXMUTEX_INITIALIZER,
  .request_lock = SP_UNLOCKED,
};

/* The V4L2 node accepts one capture or recording operation at a time. */
static mutex_t g_bkvision_capture_lock = NXMUTEX_INITIALIZER;

static int bkvision_errno(void)
{
  return errno > 0 ? -errno : -EIO;
}

static int bkvision_ioctl(int fd, int request, FAR void *argument)
{
  int ret = ioctl(fd, request, (unsigned long)(uintptr_t)argument);

  return ret < 0 ? bkvision_errno() : 0;
}

static void bkvision_operation_failed(
  FAR struct bkvision_rpc_response_s *response, int status)
{
  response->operation_status = status < 0 ? status : -EIO;
  response->width = 0;
  response->height = 0;
  response->pixel_format = 0;
  response->bytes_used = 0;
  response->capture_sequence = 0;
  response->flags = 0;
  response->reserved[0] = 0;
  response->reserved[1] = 0;
}

static int bkvision_wait_frame(int fd, FAR struct v4l2_buffer *buffer)
{
  clock_t start = clock_systime_ticks();
  clock_t limit = MSEC2TICK(CONFIG_BK7258_VISION_CAPTURE_TIMEOUT_MS);
  int ret;

  for (;;)
    {
      ret = bkvision_ioctl(fd, VIDIOC_DQBUF, buffer);
      if (ret >= 0)
        {
          return 0;
        }

      if (ret != -EAGAIN && ret != -EINTR)
        {
          return ret;
        }

      if ((clock_t)(clock_systime_ticks() - start) >= limit)
        {
          return -ETIMEDOUT;
        }

      nxsig_usleep(5000);
    }
}

static int bkvision_volume_close(void)
{
  if (g_record_mounted)
    {
      if (umount(BKVISION_MOUNTPOINT) < 0)
        {
          return bkvision_errno();
        }
      g_record_mounted = false;
    }
  if (g_record_leased)
    {
      int ret = bk7258_media_volume_release(BK7258_MEDIA_VOLUME_VISION);
      if (ret < 0)
        {
          return ret;
        }
      g_record_leased = false;
    }
  return 0;
}

static int bkvision_volume_open(bool readonly)
{
  int ret = bkvision_volume_close();
  if (ret < 0)
    {
      return ret;
    }
  ret = bk7258_media_volume_acquire(BK7258_MEDIA_VOLUME_VISION);
  if (ret < 0)
    {
      return ret;
    }
  g_record_leased = true;
  if ((mkdir("/mnt", 0777) < 0 && errno != EEXIST) ||
      (mkdir(BKVISION_MOUNTPOINT, 0777) < 0 && errno != EEXIST))
    {
      ret = bkvision_errno();
      goto fail;
    }
  /* Use the same mountpoint as the display service. An existing mount is
   * busy, never adopted or unmounted by this service. Never format media.
   */
  if (mount("/dev/mmcsd0", BKVISION_MOUNTPOINT, "vfat",
            readonly ? MS_RDONLY : 0, NULL) < 0)
    {
      ret = bkvision_errno();
      goto fail;
    }
  g_record_mounted = true;
  if (!readonly && mkdir(BKVISION_RECORD_ROOT, 0777) < 0 && errno != EEXIST)
    {
      ret = bkvision_errno();
      goto fail;
    }
  return 0;
fail:
  (void)bkvision_volume_close();
  return ret;
}

static int bkvision_check_record(
  FAR const struct bkvision_rpc_request_s *request,
  FAR struct bkvision_rpc_response_s *response)
{
  struct bkvision_record_s record;
  struct stat info;
  char path[96];
  int fd = -1;
  int ret = bkvision_volume_open(true);

  if (ret >= 0)
    {
      snprintf(path, sizeof(path), BKVISION_RECORD_ROOT "/"
               BKVISION_RECORD_NAME_FORMAT,
               (unsigned long)request->duration_ms,
               (unsigned long)request->reserved);
      fd = open(path, O_RDONLY);
      ret = fd < 0 ? bkvision_errno() : fstat(fd, &info) < 0 ?
            bkvision_errno() : !S_ISREG(info.st_mode) ? -EINVAL : 0;
      if (ret >= 0)
        {
          ret = bkvision_record_inspect(&record, fd);
        }
      if (fd >= 0 && close(fd) < 0 && ret >= 0)
        {
          ret = bkvision_errno();
        }
      int cleanup = bkvision_volume_close();
      if (ret >= 0 && cleanup < 0)
        {
          ret = cleanup;
        }
    }
  if (ret < 0)
    {
      bkvision_operation_failed(response, ret);
    }
  else
    {
      response->operation_status = 0;
      response->flags = BKVISION_FLAG_CHECKED;
      response->width = record.width;
      response->height = record.height;
      response->pixel_format = BKVISION_PIXEL_FORMAT_JPEG;
      response->bytes_used = record.bytes + 224;
      response->reserved[0] = record.frames;
      response->reserved[1] = record.payload_hash;
    }
  return ret;
}

static int bkvision_set_frame_interval(int fd)
{
  struct v4l2_streamparm parm;
  int ret;

