open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_vision_service.c
  memset(&parm, 0, sizeof(parm));
  parm.type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  parm.parm.capture.timeperframe.numerator = 1;
  parm.parm.capture.timeperframe.denominator = CONFIG_BK7258_VISION_FPS;
  ret = bkvision_ioctl(fd, VIDIOC_S_PARM, &parm);
  if (ret < 0)
    {
      return ret;
    }

  memset(&parm.parm, 0, sizeof(parm.parm));
  ret = bkvision_ioctl(fd, VIDIOC_G_PARM, &parm);
  if (ret >= 0 &&
      ((parm.parm.capture.capability & V4L2_CAP_TIMEPERFRAME) == 0 ||
       parm.parm.capture.timeperframe.numerator == 0 ||
       (uint64_t)parm.parm.capture.timeperframe.numerator *
         CONFIG_BK7258_VISION_FPS !=
         parm.parm.capture.timeperframe.denominator))
    {
      ret = -EPROTO;
    }

  return ret;
}

static int bkvision_capture(
  FAR const struct bkvision_rpc_request_s *request,
  FAR struct bkvision_rpc_response_s *response,
  FAR uint8_t *destination, size_t destination_capacity,
  FAR size_t *destination_size)
{
  struct v4l2_requestbuffers request_buffers;
  enum v4l2_buf_type type = V4L2_BUF_TYPE_VIDEO_CAPTURE;
  struct v4l2_format format;
  struct v4l2_buffer buffer;
  FAR uint8_t *mapping[BKVISION_RECORD_BUFFERS];
  size_t mapping_length[BKVISION_RECORD_BUFFERS] = {0};
  struct bkvision_record_s record;
  FAR uint8_t *write_buffer = NULL;
  char path[96] = {0};
  bool recording = request->command == BKVISION_RPC_RECORD;
  bool volume = false;
  bool created = false;
  unsigned int count = recording ? BKVISION_RECORD_BUFFERS : 1;
  unsigned int i;
  clock_t started = 0;
  uint32_t elapsed_ms = 0;
  int output = -1;
  bool streaming = false;
  int fd = -1;
  int result;
  int cleanup;

  if (destination_size != NULL)
    {
      *destination_size = 0;
    }

  if ((destination == NULL) != (destination_size == NULL))
    {
      bkvision_operation_failed(response, -EINVAL);
      return -EINVAL;
    }

  result = nxmutex_trylock(&g_bkvision_capture_lock);
  if (result < 0)
    {
      bkvision_operation_failed(response, result == -EBUSY ? -EBUSY : result);
      return result == -EBUSY ? -EBUSY : result;
    }

  for (i = 0; i < count; i++)
    {
      mapping[i] = MAP_FAILED;
    }

  if (recording)
    {
      result = bkvision_volume_open(false);
      if (result < 0)
        {
          goto out;
        }
      volume = true;
      snprintf(path, sizeof(path), BKVISION_RECORD_ROOT "/"
               BKVISION_RECORD_NAME_FORMAT,
               (unsigned long)request->session_id,
               (unsigned long)request->sequence);
      output = open(path, O_RDWR | O_CREAT | O_EXCL, 0600);
      if (output < 0)
        {
          result = bkvision_errno();
          goto out;
        }
      created = true;
    }

  fd = open(CONFIG_BK7258_VISION_DEVPATH, O_RDWR | O_NONBLOCK);
  if (fd < 0)
    {
      result = bkvision_errno();
      goto out;
    }

  memset(&format, 0, sizeof(format));
  format.type = type;
  format.fmt.pix.width = CONFIG_BK7258_VISION_WIDTH;
  format.fmt.pix.height = CONFIG_BK7258_VISION_HEIGHT;
  format.fmt.pix.field = V4L2_FIELD_ANY;
  format.fmt.pix.pixelformat = V4L2_PIX_FMT_JPEG;
  format.fmt.pix.sizeimage = CONFIG_BK7258_VISION_JPEG_BUFFER_BYTES;
  result = bkvision_ioctl(fd, VIDIOC_S_FMT, &format);
  if (result < 0)
    {
      goto out;
    }

  memset(&format, 0, sizeof(format));
  format.type = type;
  result = bkvision_ioctl(fd, VIDIOC_G_FMT, &format);
  if (result < 0)
    {
      goto out;
    }

  if (format.fmt.pix.width == 0 || format.fmt.pix.height == 0 ||
      format.fmt.pix.pixelformat != V4L2_PIX_FMT_JPEG ||
      format.fmt.pix.sizeimage < 4 ||
      format.fmt.pix.sizeimage > CONFIG_BK7258_VISION_JPEG_BUFFER_BYTES)
    {
      result = -EPROTO;
      goto out;
    }

  result = bkvision_set_frame_interval(fd);
  if (result < 0)
    {
      goto out;
    }

  memset(&request_buffers, 0, sizeof(request_buffers));
  request_buffers.type = type;
  request_buffers.memory = V4L2_MEMORY_MMAP;
  request_buffers.mode = V4L2_BUF_MODE_FIFO;
  request_buffers.count = count;
  result = bkvision_ioctl(fd, VIDIOC_REQBUFS, &request_buffers);
  if (result < 0)
    {
      goto out;
    }

  if (request_buffers.count != count)
    {
      result = -ENOMEM;
      goto out;
    }

  for (i = 0; i < count; i++)
    {
      memset(&buffer, 0, sizeof(buffer));
      buffer.type = type;
      buffer.memory = V4L2_MEMORY_MMAP;
      buffer.index = i;
      result = bkvision_ioctl(fd, VIDIOC_QUERYBUF, &buffer);
      if (result < 0)
        {
          goto out;
        }
      mapping_length[i] = buffer.length;
      if (mapping_length[i] < format.fmt.pix.sizeimage)
        {
          result = -EOVERFLOW;
          goto out;
        }
      mapping[i] = mmap(NULL, mapping_length[i], PROT_READ | PROT_WRITE,
                        MAP_SHARED, fd, buffer.m.offset);
      if (mapping[i] == MAP_FAILED)
        {
          result = bkvision_errno();
          goto out;
        }
      result = bkvision_ioctl(fd, VIDIOC_QBUF, &buffer);
      if (result < 0)
        {
          goto out;
        }
    }

  if (recording)
    {
      result = bkvision_record_begin(&record, output, format.fmt.pix.width,
                                     format.fmt.pix.height);
      if (result >= 0)
        {
          write_buffer = malloc(BKVISION_RECORD_WRITE_BUFFER_SIZE);
          result = write_buffer == NULL ? -ENOMEM :
            bkvision_record_set_buffer(&record, write_buffer,
                                        BKVISION_RECORD_WRITE_BUFFER_SIZE);
        }
      if (result < 0)
        {
          goto out;
        }
    }
  result = bkvision_ioctl(fd, VIDIOC_STREAMON, &type);
  if (result < 0)
    {
      goto out;
    }

  streaming = true;
  started = clock_systime_ticks();
  do
    {
      memset(&buffer, 0, sizeof(buffer));
      buffer.type = type;
      buffer.memory = V4L2_MEMORY_MMAP;
      result = bkvision_wait_frame(fd, &buffer);
      if (result < 0)
        {
          goto out;
        }
      if (buffer.index >= count)
        {
          result = -EPROTO;
          goto out;
        }
      if (destination != NULL)
        {
          result = bkvision_copy_jpeg_frame(
            response, destination, destination_capacity, destination_size,
            mapping[buffer.index], mapping_length[buffer.index],
            buffer.bytesused, buffer.flags & V4L2_BUF_FLAG_ERROR,
            format.fmt.pix.width, format.fmt.pix.height,
            format.fmt.pix.pixelformat, buffer.sequence);
        }
      else
        {
          result = bkvision_rpc_validate_frame(
            response, mapping[buffer.index], mapping_length[buffer.index],
            buffer.bytesused, buffer.flags & V4L2_BUF_FLAG_ERROR,
            format.fmt.pix.width, format.fmt.pix.height,
            format.fmt.pix.pixelformat, buffer.sequence);
        }
      if (result < 0 || !recording)
        {
          break;
        }
      if (recording)
        {
          result = bkvision_record_frame(&record, mapping[buffer.index],
                                         buffer.bytesused);
          if (result < 0)
            {
              goto out;
            }
        }
      /* The writer has copied the JPEG before it returns. Its own staging
       * buffer remains valid across QBUF and is flushed before final fsync.
       */
      buffer.bytesused = 0;
      result = bkvision_ioctl(fd, VIDIOC_QBUF, &buffer);
      if (result < 0)
        {
          goto out;
        }
      elapsed_ms = TICK2MSEC(clock_systime_ticks() - started);
    }
  while (elapsed_ms < request->duration_ms);

out:
  if (streaming)
    {
      cleanup = bkvision_ioctl(fd, VIDIOC_STREAMOFF, &type);
      if (result >= 0 && cleanup < 0)
        {
          result = cleanup;
        }
    }

  for (i = 0; i < count; i++)
    {
      if (mapping[i] != MAP_FAILED)
        {
          /* Flat-address-space MMAP is freed by sole-owner final close.
           * NuttX legitimately returns EINVAL from munmap for this driver.
           */
          (void)munmap(mapping[i], mapping_length[i]);
        }
    }

  if (fd >= 0)
    {
      cleanup = close(fd);
      if (cleanup < 0)
        {
          cleanup = bkvision_errno();
        }

      if (result >= 0 && cleanup < 0)
        {
          result = cleanup;
        }
    }

