open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_vision_service.c
  if (output >= 0)
    {
      if (result >= 0)
        {
          result = bkvision_record_finish(&record, elapsed_ms);
        }

      if (output >= 0 && close(output) < 0 && result >= 0)
        {
          result = bkvision_errno();
        }
      if (result >= 0)
        {
          response->flags |= BKVISION_FLAG_RECORDED;
          response->reserved[0] = record.frames;
          response->reserved[1] = elapsed_ms;
          response->bytes_used = record.bytes + 224;
        }
    }
  free(write_buffer);
  if (result < 0 && created)
    {
      (void)unlink(path);
    }
  if (volume)
    {
      cleanup = bkvision_volume_close();
      if (result >= 0 && cleanup < 0)
        {
          result = cleanup;
        }
    }

  if (result < 0)
    {
      if (destination != NULL && destination_size != NULL &&
          *destination_size != 0)
        {
          memset(destination, 0, *destination_size);
          *destination_size = 0;
        }
      bkvision_operation_failed(response, result);
    }

  nxmutex_unlock(&g_bkvision_capture_lock);
  return result;
}

int bk7258_vision_capture_jpeg(uint8_t *destination,
                                size_t destination_capacity,
                                size_t *destination_size)
{
  struct bkvision_rpc_request_s request;
  struct bkvision_rpc_response_s response;
  int ret;
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  struct bkvision_feedback_s feedback;
#endif

  if (destination_size != NULL)
    {
      *destination_size = 0;
    }

  if (destination == NULL || destination_size == NULL ||
      destination_capacity == 0)
    {
      return -EINVAL;
    }

  memset(&request, 0, sizeof(request));
  memset(&response, 0, sizeof(response));
  request.command = BKVISION_RPC_SNAPSHOT;
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  bkvision_feedback_initialize(&feedback, &g_bkvision_feedback_ops);
  bkvision_feedback_snapshot_begin(&feedback);
#endif
  ret = bkvision_capture(&request, &response, destination,
                         destination_capacity, destination_size);
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
  bkvision_feedback_snapshot_finish(&feedback, ret == 0);
#endif
  return ret;
}

static int bkvision_send(
  FAR struct bkvision_server_s *server,
  FAR const struct bkvision_rpc_response_s *response)
{
  int ret = nxmutex_lock(&server->endpoint_lock);

  if (ret < 0)
    {
      return ret;
    }

  if (!__atomic_load_n(&server->endpoint_created, __ATOMIC_ACQUIRE) ||
      !is_rpmsg_ept_ready(&server->endpoint))
    {
      ret = -ENOTCONN;
    }
  else
    {
      ret = rpmsg_trysend(&server->endpoint, response, sizeof(*response));
    }

  nxmutex_unlock(&server->endpoint_lock);
  return ret;
}

static int bkvision_worker(int argc, FAR char **argv)
{
  FAR struct bkvision_server_s *server = &g_bkvision_server;

  (void)argc;
  (void)argv;
  for (;;)
    {
      struct bkvision_rpc_request_s request;
      struct bkvision_rpc_response_s response;
      irqstate_t flags;

#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      struct bkvision_feedback_s feedback;
      bool snapshot;
#endif

      if (nxsem_wait_uninterruptible(&server->request_sem) < 0)
        {
          continue;
        }

      flags = spin_lock_irqsave(&server->request_lock);
      memcpy(&request, &server->active_request, sizeof(request));
      spin_unlock_irqrestore(&server->request_lock, flags);

      bkvision_rpc_make_response(&response, &request, 0);
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      snapshot = request.command == BKVISION_RPC_SNAPSHOT;
      if (snapshot)
        {
          bkvision_feedback_initialize(&feedback,
                                       &g_bkvision_feedback_ops);
          bkvision_feedback_snapshot_begin(&feedback);
        }
#endif
      if (request.command == BKVISION_RPC_CHECK_RECORD)
        {
          (void)bkvision_check_record(&request, &response);
        }
      else
        {
          (void)bkvision_capture(&request, &response, NULL, 0, NULL);
        }

      flags = spin_lock_irqsave(&server->request_lock);
      memcpy(&server->last_request, &request, sizeof(request));
      memcpy(&server->last_response, &response, sizeof(response));
      server->replay_valid = true;
      server->active = false;
      spin_unlock_irqrestore(&server->request_lock, flags);

      (void)bkvision_send(server, &response);
#ifdef CONFIG_BK7258_DISPLAY_SERVICE
      if (snapshot)
        {
          bkvision_feedback_snapshot_finish(
            &feedback, response.operation_status == 0);
        }
#endif
    }

  return 0;
}

static int bkvision_server_cb(FAR struct rpmsg_endpoint *endpoint,
                              FAR void *data, size_t len, uint32_t src,
                              FAR void *priv)
{
  FAR struct bkvision_server_s *server = priv;
  FAR const struct bkvision_rpc_request_s *request = data;
  struct bkvision_rpc_response_s response;
  irqstate_t flags;
  bool replay = false;
  bool duplicate;
  int ret;

  (void)endpoint;
  (void)src;
  if (request == NULL || len != sizeof(*request) ||
      request->magic != BKVISION_RPC_MAGIC ||
      request->version != BKVISION_RPC_VERSION)
    {
      return -EINVAL;
    }

  if (!bkvision_rpc_request_valid(request))
    {
      bkvision_rpc_make_response(&response, request, -EINVAL);
      return bkvision_send(server, &response);
    }

  flags = spin_lock_irqsave(&server->request_lock);
  if (server->replay_valid &&
      request->session_id == server->last_request.session_id &&
      request->sequence == server->last_request.sequence)
    {
      if (memcmp(request, &server->last_request, sizeof(*request)) != 0)
        {
          spin_unlock_irqrestore(&server->request_lock, flags);
          bkvision_rpc_make_response(&response, request, -EPROTO);
          return bkvision_send(server, &response);
        }

      memcpy(&response, &server->last_response, sizeof(response));
      replay = true;
    }
  else if (server->active)
    {
      duplicate = memcmp(request, &server->active_request,
                         sizeof(*request)) == 0;
      spin_unlock_irqrestore(&server->request_lock, flags);
      if (duplicate)
        {
          return 0;
        }

      bkvision_rpc_make_response(&response, request, -EBUSY);
      return bkvision_send(server, &response);
    }
  else
    {
      memcpy(&server->active_request, request, sizeof(*request));
      server->active = true;
    }

  spin_unlock_irqrestore(&server->request_lock, flags);
  if (replay)
    {
      return bkvision_send(server, &response);
    }

  ret = nxsem_post(&server->request_sem);
  if (ret >= 0)
    {
      return 0;
    }

  flags = spin_lock_irqsave(&server->request_lock);
  server->active = false;
  spin_unlock_irqrestore(&server->request_lock, flags);
  bkvision_rpc_make_response(&response, request, ret);
  return bkvision_send(server, &response);
}

static bool bkvision_ns_match(FAR struct rpmsg_device *rdev, FAR void *priv,
                              FAR const char *name, uint32_t dest)
{
  FAR const char *cpu = rpmsg_get_cpuname(rdev);

  (void)priv;
  (void)dest;
  return cpu != NULL && strcmp(cpu, "cp") == 0 &&
         strcmp(name, BKVISION_RPC_ENDPOINT) == 0;
}

static void bkvision_ns_bind(FAR struct rpmsg_device *rdev, FAR void *priv,
                             FAR const char *name, uint32_t dest)
{
  FAR struct bkvision_server_s *server = priv;

  if (nxmutex_lock(&server->endpoint_lock) < 0)
    {
      return;
    }

  if (!__atomic_load_n(&server->endpoint_created, __ATOMIC_ACQUIRE))
    {
      server->endpoint.priv = server;
      if (rpmsg_create_ept(&server->endpoint, rdev, name, RPMSG_ADDR_ANY,
                           dest, bkvision_server_cb, NULL) >= 0)
        {
          __atomic_store_n(&server->endpoint_created, true,
                           __ATOMIC_RELEASE);
        }
    }

