open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_vision_service.c
  nxmutex_unlock(&server->endpoint_lock);
}

static void bkvision_device_destroy(FAR struct rpmsg_device *rdev,
                                    FAR void *priv)
{
  FAR struct bkvision_server_s *server = priv;
  FAR const char *cpu = rpmsg_get_cpuname(rdev);

  if (cpu == NULL || strcmp(cpu, "cp") != 0)
    {
      return;
    }

  __atomic_store_n(&server->endpoint_created, false, __ATOMIC_RELEASE);
  if (nxmutex_lock(&server->endpoint_lock) >= 0)
    {
      if (server->endpoint.rdev != NULL)
        {
          rpmsg_destroy_ept(&server->endpoint);
        }

      memset(&server->endpoint, 0, sizeof(server->endpoint));
      nxmutex_unlock(&server->endpoint_lock);
    }
}

int bk7258_vision_service_prepare(void)
{
  return 0;
}

int bk7258_vision_service_start(void)
{
  FAR struct bkvision_server_s *server = &g_bkvision_server;
  bool semaphore_initialized = false;
  bool callback_registered = false;
  pid_t pid;
  int ret;

  ret = nxmutex_lock(&server->init_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (__atomic_load_n(&server->initialized, __ATOMIC_ACQUIRE))
    {
      nxmutex_unlock(&server->init_lock);
      return 0;
    }

  ret = nxsem_init(&server->request_sem, 0, 0);
  if (ret >= 0)
    {
      semaphore_initialized = true;
    }

#ifdef CONFIG_PRIORITY_INHERITANCE
  if (ret >= 0)
    {
      ret = nxsem_set_protocol(&server->request_sem, SEM_PRIO_NONE);
    }
#endif

  if (ret >= 0)
    {
      ret = rpmsg_register_callback(server, NULL, bkvision_device_destroy,
                                    bkvision_ns_match, bkvision_ns_bind);
      callback_registered = ret >= 0;
    }

  if (ret >= 0)
    {
      pid = task_create("bkvision-rpc", CONFIG_BK7258_VISION_RPC_PRIORITY,
                        CONFIG_BK7258_VISION_RPC_STACKSIZE, bkvision_worker,
                        NULL);
      if (pid < 0)
        {
          ret = bkvision_errno();
        }
    }

  if (ret >= 0)
    {
      __atomic_store_n(&server->initialized, true, __ATOMIC_RELEASE);
    }
  else
    {
      if (callback_registered)
        {
          rpmsg_unregister_callback(server, NULL, bkvision_device_destroy,
                                    bkvision_ns_match, bkvision_ns_bind);
        }

      if (nxmutex_lock(&server->endpoint_lock) >= 0)
        {
          __atomic_store_n(&server->endpoint_created, false,
                           __ATOMIC_RELEASE);
          if (server->endpoint.rdev != NULL)
            {
              rpmsg_destroy_ept(&server->endpoint);
            }

          memset(&server->endpoint, 0, sizeof(server->endpoint));
          nxmutex_unlock(&server->endpoint_lock);
        }

      if (semaphore_initialized)
        {
          (void)nxsem_destroy(&server->request_sem);
        }

      server->active = false;
      server->replay_valid = false;
    }

  nxmutex_unlock(&server->init_lock);
  return ret;
}

#endif /* CONFIG_BK7258_VISION_SERVICE */
